Revit 2026 API

# LightGroup Properties

---

The LightGroup type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | The ElementId of the LightGroup |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of the LightGroup |

#### Reference

LightGroup Class

Autodesk.Revit.DB.Lighting Namespace